---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.CutFailures.CannotCutGeometryWarn
source: html/3ecc065c-dcf0-3b97-96da-95c7a00a92e0.htm
---
# Autodesk.Revit.DB.BuiltInFailures.CutFailures.CannotCutGeometryWarn Property

Elements do not intersect.

## Syntax (C#)
```csharp
public static FailureDefinitionId CannotCutGeometryWarn { get; }
```